/**
 * PoProcessCodeEnum.java 2013-9-22
 */
package org.macula.cloud.po.gbss.type;

/**
 * <p>
 * <b>PoProcessCodeEnum</b> 是单据流程代码枚举类
 * </p>
 *
 
 
 
 */
public enum PoProcessCodeEnum {
	
	// ********** 前端购货 **********
	/**
	 * 个人购货
	 */
	G001("G001", "个人购货"),
	/**
	 * 个人零售
	 */
	G002("G002", "个人零售"),
	/**
	 * 个人推荐
	 */
	G003("G003", "个人推荐"),
	/**
	 * 个人申请业务员/直销员
	 */
	G004("G004", "个人申请业务员/直销员"),
	/**
	 * 个人购货延迟收货申请
	 */
	G005("G005", "个人购货延迟收货申请"),
	/**
	 * 个人大宗购货
	 */
	G006("G006", "个人大宗购货"),
	/**
	 * 个人预购货
	 */
	G007("G007", "个人预购货"),
	/**
	 * 个人合并购货
	 */
	G008("G008", "个人合并购货"),
	/**
	 * 个人预购货申请
	 */
	G009("G009", "个人预购货申请"),
	/**
	 * 个人换购
	 */
	G010("G010", "个人换购"),
	
	/**
	 * 个人换购
	 */
	G012("G012", "纷享绘订购"),
	
	/**
	 * 持卡人预售
	 */
	G022("G022", "持卡人预售"),
	/**
	 * 持卡人预售
	 */
	G023("G023", "注册会员预售"),
	
	// ********** 店铺订货  ***********
	/**
	 * 店铺订货
	 */
	G101("G101", "店铺订货"),
	/**
	 * 店铺订货延迟收货申请
	 */
	G102("G102", "店铺订货延迟收货申请"),
	/**
	 * 店铺大宗订货
	 */
	G103("G103", "店铺大宗订货"),
	/**
	 * 店铺预订货
	 */
	G104("G104", "店铺预订货"),
	/**
	 * 店铺订货退货
	 */
	G105("G105", "店铺订货退货"),
	/**
	 * 店铺预订货申请
	 */
	G106("G106", "店铺预订货申请"),
	/**
	 * 店铺订货延迟收货申请
	 */
	G107("G107", "店铺订货延迟收货申请"),
	// ******** 回单销售  ************
	/**
	 * 回单销售
	 */
	G201("G201", "回单销售"),
	/**
	 * 回单零售
	 */
	G202("G202", "回单零售"),
	/**
	 * 回单推荐
	 */
	G203("G203", "回单推荐"),
	/**
	 * 回单申请业务员/直销员
	 */
	G204("G204", "回单申请业务员/直销员"),
	/**
	 * 回单退货(本店销售)
	 */
	G205("G205", "回单退货(本店销售)"),
	/**
	 * 回单退货(网上购货)
	 */
	G206("G206", "回单退货(网上购货)"),
	// ******** 服务中心销售 ********
	/**
	 * 服务中心销售
	 */
	G301("G301", "服务中心销售"),
	/**
	 * 服务中心零售
	 */
	G302("G302", "服务中心零售"),
	/**
	 * 服务中心推荐
	 */
	G303("G303", "服务中心推荐"),
	/**
	 * 服务中心申请业务员/直销员
	 */
	G304("G304", "服务中心申请业务员/直销员"),
	/**
	 * 服务中心退货(本店销售)
	 */
	G305("G305", "服务中心退货(本店销售)"),
	/**
	 * 服务中心退货(网上购货)
	 */
	G306("G306", "服务中心退货(网上购货)"),
	/**
	 * 服务中心撤单(本店销售)
	 */
	G307("G307", "服务中心撤单(本店销售)"),
	/**
	 * 服务中心退货(无参考单)
	 */
	G308("G308", "服务中心退货(无参考单)"),
	/**
	 * 服务中心换购
	 */
	G310("G310", "服务中心换购"),

	//********** 公司总部处理业务 ************
	/**
	 * 公司处理个人购货
	 */
	G401("G401", "公司处理个人购货"),

	/**
	 * 公司处理个人推荐
	 */
	G402("G402", "公司处理个人推荐"),

	/**
	 * 公司处理个人申请业务员/直销员
	 */
	G403("G403", "公司处理个人申请业务员/直销员"),

	/**
	 * 公司处理个人购货延迟收货申请
	 */
	G404("G404", "公司处理个人购货延迟收货申请"),

	/**
	 * 公司处理个人大宗购货
	 */
	G405("G405", "公司处理个人大宗购货"),

	/**
	 * 公司处理个人预购货
	 */
	G406("G406", "公司处理个人预购货"),

	/**
	 * 公司处理个人合并购货
	 */
	G407("G407", "公司处理个人合并购货"),

	/**
	 * 公司处理补个人购货
	 */
	G408("G408", "公司处理补个人购货"),

	/**
	 * 公司处理个人订货
	 */
	G409("G409", "公司处理个人订货"),

	/**
	 * 公司处理个人订货延迟收货申请
	 */
	G410("G410", "公司处理个人订货延迟收货申请"),

	/**
	 * 公司处理个人大宗订货
	 */
	G411("G411", "公司处理个人大宗订货"),

	/**
	 * 公司处理个人预订货
	 */
	G412("G412", "公司处理个人预订货"),

	/**
	 * 公司处理个人订货退货
	 */
	G413("G413", "公司处理个人订货退货"),

	/**
	 * 公司处理回单销售
	 */
	G414("G414", "公司处理回单销售"),

	/**
	 * 公司处理回单零售
	 */
	G415("G415", "公司处理回单零售"),

	/**
	 * 公司处理回单推荐
	 */
	G416("G416", "公司处理回单推荐"),

	/**
	 * 公司处理回单申请业务员/直销员
	 */
	G417("G417", "公司处理回单申请业务员/直销员"),

	/**
	 * 公司处理回单退货
	 */
	G418("G418", "公司处理回单退货"),

	/**
	 * 公司处理补回单销售
	 */
	G419("G419", "公司处理补回单销售"),

	// *******  全流程回单业务  *******
	/**
	 * 全流程回单销售
	 */
	G601("G601", "全流程回单销售"),

	/**
	 * 全流程回单推荐
	 */
	G603("G603", "全流程回单推荐"),
	
	/**
	 * 全流程销售单退货（退到预售员）
	 */
	G605("G605", "全流程销售单退货（退到预售员）"),

	// ******* 其它非常规单据 ***********
	/**
	 * 随货配送
	 */
	G901("G901", "随货配送"),
	/**
	 * 免费赠送单(服务中心)
	 */
	G902("G902", "免费赠送单(服务中心)"),
	/**
	 * 一般补损
	 */
	G903("G903", "一般补损"),
	/**
	 * 质量补损
	 */
	G904("G904", "质量补损"),
	/**
	 * 一般补损退货
	 */
	G905("G905", "一般补损退货"),
	/**
	 * 质量补损退货
	 */
	G906("G906", "质量补损退货"),
	/**
	 * 无参照质量补损单
	 */
	G907("G907", "无参照质量补损单"),
	/**
	 * 无参照质量补损退单
	 */
	G908("G908", "无参照质量补损退单"),
	/**
	 * 月刊导入
	 */
	G909("G909", "月刊导入"),
	/**
	 * 促销赠品单
	 */
	G910("G910", "促销赠品单"),
	
	/**
	 * 普通月刊
	 */
	G911("G911", "普通月刊"),

	/**
	 * 启业套装月刊
	 */
	G912("G912", "启业套装月刊"),

	/**
	 * CPP礼品兑换（个人）
	 */
	G011("G011", "CPP礼品兑换（个人）"),
	
	/**
	 * CPP礼品兑换（服务中心）
	 */
	G311("G311", "CPP礼品兑换（服务中心）"),

	/**
	 * 个人服务购货单
	 */
	G013("G013", "个人服务购货单"),
	
	
	/***
	 * 店铺代下单
	 */
	G020("G020", "店铺代下单");
	

	private String code;
	
	private String label;
	
	/**
	 * @param code
	 * @param label
	 */
	private PoProcessCodeEnum(String code, String label) {
		this.code = code;
		this.label = label;
	}

	/**
	 * 根据code获取label
	 * @param code
	 * @return
	 */
	public static String getLabel(String code) {
		for (PoProcessCodeEnum enumType : PoProcessCodeEnum.values()) {
			if (enumType.code.equals(code)) {
				return enumType.getLabel();
			}
		}
		return code;
	}

	/**
	 * @return the code
	 */
	public String getCode() {
		return code;
	}

	/**
	 * @return the label
	 */
	public String getLabel() {
		return label;
	}
	
	@Override
	public String toString() {
		return this.code;
	}

}
